In [1]:
!pip3 install psycopg2
!pip3 install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: psycopg2 in /Users/siibnu/Library/Python/3.9/lib/python/site-packages (2.9.9)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /Users/siibnu/Library/Python/3.9/lib/python/site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.22.4 in /Users/siibnu/Library/Python/3.9/lib/python/site-packages (from pandas) (1.26.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/siibnu/Library/Python/3.9/lib/python/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/siibnu/Library/Python/3.9/lib/python/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /Users/siibnu/Library/Python/3.9/lib/python/site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in /Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.9/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.15.0)

In [3]:

import psycopg2
import pandas as pd

In [4]:
conn = psycopg2.connect(database="ponorogo",
                        host="localhost",
                        user="postgres",
                        password="",
                        port="5432",
                        options="-c search_path=akademik")
cursor = conn.cursor()

In [5]:
def fetch_data_with_columns(table_name, limit=10, offset=0):

    # Eksekusi query untuk mendapatkan semua data dan nama kolom dari tabel
    query = f"SELECT * FROM {table_name} LIMIT {limit} OFFSET {offset}"
    cursor.execute(query)

    # Ambil nama kolom dari cursor.description
    column_names = [desc[0] for desc in cursor.description]

    # Ambil semua data
    data = cursor.fetchall()

    # Tutup koneksi
    cursor.close()

    return column_names, data

In [6]:
cursor = conn.cursor()
columns, data = fetch_data_with_columns("ref_status_mahasiswa")
dfStatus = pd.DataFrame(data, columns=columns)
dfStatus = dfStatus[['id_status_mahasiswa', 'nama_status_mahasiswa']]
dfStatus

  id_status_mahasiswa nama_status_mahasiswa
0                   A                 AKTIF
1                   C                  CUTI
2                   G  SEDANG DOUBLE DEGREE
3                   N             NON-AKTIF
4                   L                 LULUS
5                   K     MENGUNDURKAN DIRI
6                   P                MUTASI
7                   U         PUTUS SEKOLAH
8                   W                 WAFAT
9                   H                HILANG

In [7]:
cursor = conn.cursor()
limit = 1000
offset = 0
allData = []
df = pd.DataFrame()
for i in range(1, 5):
    print(limit, offset)
    cursor = conn.cursor()
    columns, data = fetch_data_with_columns("view_mahasiswa_predict", limit, offset)
    allData = allData + data
    offset = offset + limit

1000 0
1000 1000
1000 2000
1000 3000
1000 4000

KeyboardInterrupt:

In [ ]:
allData

NameError: name 'allData' is not defined

In [ ]:
df = pd.DataFrame(allData, columns=columns)

In [ ]:
df.shape

NameError: name 'df' is not defined

In [ ]:
df.head()

,tahun_masuk,jenis_kelamin,id_prodi,id_status_masuk_mahasiswa,sks,kode_tahun_ajaran,id_status_mahasiswa
0,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.3181818181818182,20191,N
1,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.4318181818181818,20192,N
2,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.2500000000000000,20201,N
3,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.2727272727272727,20202,N
4,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.3863636363636364,20211,N

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 7 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   tahun_masuk                300000 non-null  object
 1   jenis_kelamin              300000 non-null  object
 2   id_prodi                   300000 non-null  object
 3   id_status_masuk_mahasiswa  300000 non-null  object
 4   sks                        299937 non-null  object
 5   kode_tahun_ajaran          300000 non-null  object
 6   id_status_mahasiswa        300000 non-null  object
dtypes: object(7)
memory usage: 16.0+ MB

In [ ]:
df.isnull().sum()

tahun_masuk                   0
jenis_kelamin                 0
id_prodi                      0
id_status_masuk_mahasiswa     0
sks                          63
kode_tahun_ajaran             0
id_status_mahasiswa           0
dtype: int64

In [ ]:
# remove missing values
df.dropna(inplace=True)

In [ ]:
df.isnull().sum()

tahun_masuk                  0
jenis_kelamin                0
id_prodi                     0
id_status_masuk_mahasiswa    0
sks                          0
kode_tahun_ajaran            0
id_status_mahasiswa          0
dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 299937 entries, 0 to 299999
Data columns (total 7 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   tahun_masuk                299937 non-null  object
 1   jenis_kelamin              299937 non-null  object
 2   id_prodi                   299937 non-null  object
 3   id_status_masuk_mahasiswa  299937 non-null  object
 4   sks                        299937 non-null  object
 5   kode_tahun_ajaran          299937 non-null  object
 6   id_status_mahasiswa        299937 non-null  object
dtypes: object(7)
memory usage: 18.3+ MB

In [ ]:
# foreach data all
for column in df.columns:
    print(f"Column {column} has {df[column].nunique()} unique values")

Column tahun_masuk has 1 unique values
Column jenis_kelamin has 2 unique values
Column id_prodi has 6 unique values
Column id_status_masuk_mahasiswa has 2 unique values
Column sks has 1615 unique values
Column kode_tahun_ajaran has 8 unique values
Column id_status_mahasiswa has 2 unique values

In [ ]:
# remove kode_tahun_ajaran except 20191, 20192, 20201, 20202, 20211, 20212, 20221, 20222
df = df[df['kode_tahun_ajaran'].isin(['20191', '20192', '20201', '20202', '20211', '20212', '20221', '20222'])]

In [ ]:
# foreach data all
for column in df.columns:
    print(f"Column {column} has {df[column].nunique()} unique values")

Column tahun_masuk has 1 unique values
Column jenis_kelamin has 2 unique values
Column id_prodi has 6 unique values
Column id_status_masuk_mahasiswa has 2 unique values
Column sks has 1549 unique values
Column kode_tahun_ajaran has 8 unique values
Column id_status_mahasiswa has 2 unique values

In [ ]:
data = []
for index, row in df.iterrows():
    if(index % 8 == 0):
        data.append(row)
    indexAdd = len(data) - 1
    # bulatkan nilai IPS ke 2 angka dibelakang koma
    row['sks'] = round(row['sks'], 2)
    if row['kode_tahun_ajaran'] == '20191':
        data[indexAdd]['IPS1'] = row['sks']
    elif row['kode_tahun_ajaran'] == '20192':
        data[indexAdd]['IPS2'] = row['sks']
    elif row['kode_tahun_ajaran'] == '20201':
        data[indexAdd]['IPS3'] = row['sks']
    elif row['kode_tahun_ajaran'] == '20202':
        data[indexAdd]['IPS4'] = row['sks']
    elif row['kode_tahun_ajaran'] == '20211':
        data[indexAdd]['IPS5'] = row['sks']
    elif row['kode_tahun_ajaran'] == '20212':
        data[indexAdd]['IPS6'] = row['sks']
    elif row['kode_tahun_ajaran'] == '20221':
        data[indexAdd]['IPS7'] = row['sks']
    elif row['kode_tahun_ajaran'] == '20222':
        data[indexAdd]['IPS8'] = row['sks']
    else:
        print('unknown')

In [ ]:
data = []
for index, row in df.iterrows():
    if(index % 8 == 0):
        data.append(row)
    indexAdd = len(data) - 1
    # bulatkan nilai IPS ke 2 angka dibelakang koma
    row['ips'] = round(row['ips'], 2)
    if row['kode_tahun_ajaran'] == '20191':
        data[indexAdd]['IPS1'] = row['ips']
    elif row['kode_tahun_ajaran'] == '20192':
        data[indexAdd]['IPS2'] = row['ips']
    elif row['kode_tahun_ajaran'] == '20201':
        data[indexAdd]['IPS3'] = row['ips']
    elif row['kode_tahun_ajaran'] == '20202':
        data[indexAdd]['IPS4'] = row['ips']
    elif row['kode_tahun_ajaran'] == '20211':
        data[indexAdd]['IPS5'] = row['ips']
    elif row['kode_tahun_ajaran'] == '20212':
        data[indexAdd]['IPS6'] = row['ips']
    elif row['kode_tahun_ajaran'] == '20221':
        data[indexAdd]['IPS7'] = row['ips']
    elif row['kode_tahun_ajaran'] == '20222':
        data[indexAdd]['IPS8'] = row['ips']
    else:
        print('unknown')

In [ ]:
dfFinal = pd.DataFrame(data)

In [ ]:
dfFinal.head()

,tahun_masuk,jenis_kelamin,id_prodi,id_status_masuk_mahasiswa,sks,kode_tahun_ajaran,id_status_mahasiswa,IPS1,IPS2,IPS3,IPS4,IPS5,IPS6,IPS7,IPS8
0,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.32,20191,N,3.32,3.43,3.25,3.27,3.39,3.66,3.88,3.25
8,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.52,20191,N,3.52,3.48,3.39,3.59,3.55,3.59,3.82,0.00
16,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.40,20201,N,3.77,3.62,3.40,3.11,3.01,3.13,3.19,3.12
24,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.57,20201,N,3.22,3.12,3.25,3.19,NaN,NaN,3.35,3.67
32,2019,Perempuan,00042efb-9c8f-11ec-8c04-3a3343etik21,P,3.04,20211,N,3.59,3.71,NaN,NaN,3.04,3.58,3.30,3.46

In [ ]:
# check NaN value
dfFinal.isnull().sum()

tahun_masuk                      0
jenis_kelamin                    0
id_prodi                         0
id_status_masuk_mahasiswa        0
sks                              0
kode_tahun_ajaran                0
id_status_mahasiswa              0
IPS1                          9964
IPS2                         10671
IPS3                          5732
IPS4                          6650
IPS5                          4167
IPS6                          5578
IPS7                          5968
IPS8                          8444
dtype: int64

In [ ]:
dfFinal.info()

<class 'pandas.core.frame.DataFrame'>
Index: 37496 entries, 0 to 299992
Data columns (total 15 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   tahun_masuk                37496 non-null  object
 1   jenis_kelamin              37496 non-null  object
 2   id_prodi                   37496 non-null  object
 3   id_status_masuk_mahasiswa  37496 non-null  object
 4   sks                        37496 non-null  object
 5   kode_tahun_ajaran          37496 non-null  object
 6   id_status_mahasiswa        37496 non-null  object
 7   IPS1                       27532 non-null  object
 8   IPS2                       26825 non-null  object
 9   IPS3                       31764 non-null  object
 10  IPS4                       30846 non-null  object
 11  IPS5                       33329 non-null  object
 12  IPS6                       31918 non-null  object
 13  IPS7                       31528 non-null  object
 14  IPS8                       29052 non-null  object
dtypes: object(15)
memory usage: 4.6+ MB

In [ ]:
dfFinal.dropna(inplace=True)

In [ ]:
dfFinal.isnull().sum()

tahun_masuk                  0
jenis_kelamin                0
id_prodi                     0
id_status_masuk_mahasiswa    0
sks                          0
kode_tahun_ajaran            0
id_status_mahasiswa          0
IPS1                         0
IPS2                         0
IPS3                         0
IPS4                         0
IPS5                         0
IPS6                         0
IPS7                         0
IPS8                         0
dtype: int64

In [ ]:
dfFinal.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9917 entries, 0 to 299928
Data columns (total 15 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   tahun_masuk                9917 non-null   object
 1   jenis_kelamin              9917 non-null   object
 2   id_prodi                   9917 non-null   object
 3   id_status_masuk_mahasiswa  9917 non-null   object
 4   sks                        9917 non-null   object
 5   kode_tahun_ajaran          9917 non-null   object
 6   id_status_mahasiswa        9917 non-null   object
 7   IPS1                       9917 non-null   object
 8   IPS2                       9917 non-null   object
 9   IPS3                       9917 non-null   object
 10  IPS4                       9917 non-null   object
 11  IPS5                       9917 non-null   object
 12  IPS6                       9917 non-null   object
 13  IPS7                       9917 non-null   object
 14  IPS8                       9917 non-null   object
dtypes: object(15)
memory usage: 1.2+ MB

In [ ]:
dfFinal.shape

(9917, 15)

In [ ]:
# export to csv
dfFinal.to_csv('data.csv', index=False)

In [ ]:
# count id_status_mahasiswa per status
dfFinal['id_status_mahasiswa'].value_counts()

id_status_mahasiswa
L    5866
N    4051
Name: count, dtype: int64

In [ ]:
conn.close()